// src/components/PDFDocument.js
import React from "react";
import {
    Page,
    Text,
    View,
    Document,
    StyleSheet,
    Image,
    Font,
} from "@react-pdf/renderer";
import roboto from "./Roboto-Regular.ttf"; // Укажите путь к вашему файлу шрифта
import UserDataStore from "../../store/userData";

// Регистрация шрифта
Font.register({
    family: "Roboto",
    src: roboto,
    fontWeight: "normal",
});

// Создание стилей
const styles = StyleSheet.create({
    page: {
        fontFamily: "Roboto",
        fontSize: 14,
        padding: 20,
    },
    section: {
        margin: 10,
        padding: 10,
        flexGrow: 1,
        textAlign: "justify",
    },
    image: {
        width: 160,
        height: 50,
        marginVertical: 15,
    },
    title: {
        textAlign: "center",
        fontSize: 18,
        marginBottom: 40,
        fontWeight: "bold",
    },
    subTitle: {
        textAlign: "justify",
        fontSize: 16,
        marginBottom: 40,
    },
    first: {
        marginLeft: 60,
    },
    main: {
        fontSize: 14,
    },
    tab: {
        // marginLeft: 10,
        textIndent: 30,
    },
    marginTop: {
        textIndent: 30,
        marginTop: 20,
    },
    tab2: {
        textIndent: 30,
        marginBottom: 30,
    },
    flexeble: {
        display: "flex",
        flexDirection: "row",
        justifyContent: "space-between",
        fontSize: 12,
    },
    blocks: {
        display: "block",
        width: "47%",
    },
});

function kzDoc(signature) {
    return (
        <>
            <Page style={styles.page}>
                <View style={styles.section}>
                    <Text style={styles.title}>
                        Ақылы медициналық қызметтер көрсетуге арналған ашық
                        (жария) оферта шартына қосымша
                    </Text>

                    <Text style={styles.title}>
                        Пациенттің ақылы қызмет көрсетуге ақпараттандырылған
                        ерікті келісімі
                    </Text>

                    <Text style={styles.tab}>
                        Мен, пациент/заңды өкілі: {UserDataStore.user.fio}, ЖСН{" "}
                        {UserDataStore.user.iin} , «ҮМІТ» Халықаралық
                        онкологиялық томотерапия орталығы» ЖШС (бұдан әрі –
                        Орталық) бола отырып, ақылы медициналық қызметтерді
                        алғанға дейін Орталық мені қолжетімді нысанда Қазақстан
                        Республикасы Денсаулық сақтау министрлігінің 2020 жылғы
                        29 қазандағы № ҚР ДСМ-170/2020 бұйрығымен бекітілген
                        Денсаулық сақтау субъектілерінің ақылы қызметтерді
                        көрсету қағидаларымен таныстырғанын растаймын және
                        Орталықтың бөлімшесінде маған ақылы негізде көрсетілетін
                        тексеру мен емдеу менің таңдауым мен қалауым бойынша
                        жүргізілетініне хабардар етілдім және келісемін, мен
                        тегін емделуден бас тартамын және көрсетілген ақылы
                        медициналық қызметтерді, оның ішінде ауруханада болуды
                        (күндізгі стационар) төлеуге кепілдік беремін, сондай-ақ
                        маған мыналар туралы хабарланды:
                    </Text>

                    <Text style={styles.tab}>
                        - тегін медициналық көмектің кепілдік берілген көлемінің
                        тізбесіне сәйкес ауруханаға жатқызу және емделуге
                        құқығым туралы («Тегін медициналық көмектің кепілдік
                        берілген көлемінің тізбесін бекіту туралы» Қазақстан
                        Республикасы Үкіметінің 2009 жылғы 15 желтоқсандығы №
                        2136 Қаулысы Қазақстан Республикасы Үкіметінің 2009
                        жылғы 28 қыркүйектегі № 2136 қаулысына сәйкес) және
                        медициналық көмектің тиісті түрлері мен көлемдерін
                        алымсыз алу және ақылы емделу пайдасына тегін емдеуден
                        өз еркімен бас тарту мүмкіндігі туралы;
                    </Text>
                    <Text style={styles.tab}>
                        - Орталық ұсынатын ақылы медициналық қызметтердің
                        тізбесі, ақылы қызметтерге бағалар, оларды көрсету мен
                        төлеудің шарттары, нысаны мен тәртібі, сондай-ақ алдын
                        ала қарау мен емдеу жоспары, негізгі/қосалқы аурулар
                        шеңберінде алдын ала төлеу сомасы, бұл жағдайда негізгі
                        және қосалқы ауруларды тексеру, емдеу және төлеу туралы
                        түпкілікті келісім жұмыс процесінде жүзеге асырылады
                        (ауруханадан шыққан күні ақы төлеуге Калькуляция
                        (орындалған жұмыс туралы акт) және белгіленген нысанда
                        медициналық құжаттамадан үзінді көшірме беріледі);
                    </Text>
                    <Text style={styles.tab}>
                        - азаматтардың жекелеген санаттары үшін ақылы қызмет
                        көрсетудегі жеңілдіктер туралы;
                    </Text>
                    <Text style={styles.tab}>
                        - ақылы медициналық қызмет көрсетумен айналысатын
                        медицина қызметкерлері, олардың кәсіптік білім деңгейі
                        мен біліктілігі туралы;
                    </Text>
                    <Text style={styles.tab}>
                        - Орталық туралы ақпарат, оның ішінде Орталықтың
                        медициналық қызметті жүзеге асыруға лицензиясы туралы
                        ақпаратты (берілген күні мен нөмірі, лицензияланатын
                        қызмет түрінің кіші түрлерінің тізбесі, лицензиардың
                        толық атауы ), жұмыс уақыты, медициналық қызметкерлердің
                        жұмыс кестесі туралы; тегін медициналық көмектің
                        кепілдік берілген көлемі шеңберінде медициналық көмек
                        көрсетуге және (немесе) міндетті әлеуметтік медициналық
                        сақтандыру жүйесіне, ақылы қызметтерге тартылған
                        қызметкерлер;
                    </Text>
                    <Text style={styles.tab}>
                        - бақылаушы органдар туралы: уәкілетті органның,
                        астананың денсаулық сақтау саласындағы жергілікті
                        уәкілетті органының, медициналық қызметтер көрсету
                        (көмек көрсету) саласындағы мемлекеттік органның
                        аумақтық бөлімшелерінің, дәрілік заттар мен медициналық
                        мақсаттағы бұйымдар айналымы саласындағы мемлекеттік
                        органның аумақтық бөлімшелерінің мекенжайлары мен
                        телефондары;
                    </Text>
                    <Text style={styles.tab}>
                        - ақылы медициналық қызмет көрсету кезіндегі мақсаттары,
                        сипаты, қауіп факторлары және мүмкін болатын асқынулар
                        туралы;
                    </Text>
                    <Text style={styles.tab}>
                        - қажетті талдаулар мен зерттеулерді жинау
                        санитарлық-эпидемиологиялық қадағалаудың қолданыстағы
                        талаптарына сәйкес және емдеуші дәрігердің айғақтары
                        бойынша жүргізілетінін, ал соңғысының ескерілетін
                        мерзімдері 10 күннен аспауы тиіс;
                    </Text>
                    <Text style={styles.tab}>
                        - ақылы медициналық қызметтер көрсету қағидаларында
                        көзделген өзге де мәліметтер.
                    </Text>
                    <Text style={styles.tab}>Мен:</Text>
                    <Text style={styles.tab}>
                        - емдеуші дәрігердің (консилиум) тағайындаулары бойынша,
                        күрделі және даулы диагностикалық жағдайларда,
                        көрсетілімдер бойынша және сұраныс бойынша (тексеру мен
                        емге жауаптың мониторингі және т.б.) алдын ала
                        келіскеннен кейін және менің мүдделеріме нұсқан
                        келтірместей көп реттік зерттеулерге рұқсат жүргізуге
                        жол берілетіні;
                    </Text>
                    <Text style={styles.tab}>
                        - мамандандырылған емдеу мекемелерінде емделуді қажет
                        ететін бейінді емес аурулар (жұқпалы, психикалық және
                        т.б.) госпитализацияға дейін және емдеу кезінде
                        анықталған жағдайда, сондай-ақ соматикалық
                        декомпенсацияланған және басқа да аурулар кезінде
                        орталық ақылы емделуден бас тартуға құқылы; тұрғылықты
                        жері бойынша амбулаториялық емделуді қажет ететін
                        терминалдық асқынулар сатысында;
                    </Text>
                    <Text style={styles.tab}>
                        - төтенше және қауіп төнген жағдайда, медициналық
                        көмектің кепілдік берілген көлемі шеңберінде Астана
                        қаласындағы жедел емханаларға ауыстыру туралы, ал бас
                        тартқан жағдайда – емхананың жедел медициналық көмек
                        көрсететін бөлімшелеріне ауыстыру мүмкіндігі туралы;
                    </Text>
                    <Text style={styles.tab}>
                        - егер тексеру және емдеу кезінде денсаулығыма қауіп
                        төндіретін күтпеген асқынулар туындаса, кейіннен бұл
                        туралы маған хабарлай отырып, емдеудің сипатын (оның
                        ішінде хирургиялық араласу көлемін) өзгертуге, оның
                        ішінде оны жүргізуден бас тартуға келісемін;
                    </Text>
                    <Text style={styles.tab}>
                        - Орталық дәлелді себептермен қабылдау уақыты мен күніне
                        дейін 2 (екі) сағаттан кешіктірмей телефон арқылы
                        хабарламамен емдеуші дәрігерді ауыстыруға құқылы, мен
                        Орталыққа хабарлама беру арқылы ауыстырудан бас тартуға
                        немесе Орталықпен келісе отырып, қабылдауды басқа
                        күнге/уақытқа ауыстыру құқығым бар екенін растаймын, осы
                        жағдайларда дәрігердің ауыстырылуына байланысты
                        Орталыққа ешқандай шағымым болмайды.
                    </Text>
                    <Text style={styles.tab}>
                        - өтінішті толтыру кезінде көрсетілген телефон
                        қоңыраулары немесе электрондық пошта арқылы ақылы
                        медициналық қызметтерді көрсету шеңберінде ақпаратты
                        беруге болатыны туралы хабардармын және келісемін.
                        Электрондық пошта {UserDataStore.user.Email}
                    </Text>
                    <Text style={styles.tab}>
                        Маған Орталықтың (ақылы медициналық қызмет көрсететін
                        медицина қызметкерінің) нұсқауларын, оның ішінде
                        белгіленген емдеу режимін (ұсынымдарын) орындамау
                        көрсетілетін ақылы медициналық қызметтің сапасын
                        төмендетуі, оны дер кезінде аяқтауға кедергі келтіруі
                        немесе денсаулық жағдайына теріс әсер ететіні туралы
                        ескертілді. Осымен мен Орталықта алғым келетін ақылы
                        медициналық қызмет түрлерін өз еркіммен, өз құқығыммен
                        және өз мүддемде ешқандай мәжбүрлеусіз таңдағаныма,
                        Орталықта қолданыстағы ақылы медициналық қызметтерді
                        және басқа да ақылы қызметтер көрсету прейскурантымен
                        танысқаныма және оларға сәйкес төлем жасауға келісе
                        отырып, қызмет көрсеткені үшін төлем қабылдауына
                        болашақта Орталыққа менің материалдық немесе материалдық
                        емес шағымдарым болмайтынына кепілдік беремін.
                    </Text>
                    <Text style={styles.tab}>
                        Мен осы ақпараттандырылған келісімнің мәтінімен
                        танысқанымды, түсіндірме әңгімеден кейін оған қол
                        қойғанымды, оның ережелері маған түсінікті екенін, мен
                        Орталықта ақылы медициналық және басқа да ақылы
                        қызметтерді алуға және төлеуге келісімімді беретінімді
                        және Орталыққа Қазақстан Республикасының заңнамасына
                        сәйкес көлемде және тәсілде қажетті дербес деректерді
                        жинауына, өңдеуіне, беруіне келісімімді беретінімді
                        растаймын.
                    </Text>
                    <Text style={styles.tab}>
                        Бұл ақылы медициналық қызметтерді көрсетуге арналған
                        ақпараттандырылған ерікті келісім акцепт арқылы
                        қабылданады және ақылы медициналық қызметтерді көрсетуге
                        арналған ашық (жария) оферта шартының ажырамас бөлігі
                        болып табылады, оны Тапсырыс беруші/Пациент көрсетілген
                        Шартқа тұтастай, ешқандай шарттарсыз, ерекшеліктерсіз
                        немесе ескертулерсіз қосылу арқылы қабылдайды.
                    </Text>
                    <Text style={styles.tab}>
                        Мен осы ақылы қызметтерді көрсетуге пациенттің
                        ақпараттандырылған келісімінің көшірмесін алдым.
                    </Text>

                    <Text style={styles.marginTop}>
                        күні {date.getDate()}.{date.getMonth() + 1}.
                        {date.getFullYear()}
                    </Text>
                    <Text>{UserDataStore.user.fio}</Text>

                    {signature && (
                        <Image style={styles.image} src={signature} />
                    )}
                </View>
            </Page>
            <Page style={styles.page}>
                <View style={styles.section}>
                    <Text style={styles.title}>
                        Ақылы медициналық қызметтерді (көмекті) көрсетуге
                        арналған № _____ ШАРТЫ
                    </Text>
                    <Text style={styles.tab}>
                        «ҮМІТ» Халықаралық онкологиялық томотерапия орталығы»
                        ЖШС, бұдан әрі «Орындаушы», жарғы негізінде әрекет
                        ететін Директоры Е.М. Шаяхметов тұлғасында бір тараптан,
                        және бұдан әрі «Тапсырыс беруші»/«Пациент» деп аталатын
                        {UserDataStore.user.fio}, {UserDataStore.user.data} жылы
                        туылған, жеке куәлігі (төлқұжат){" "}
                        {UserDataStore.user.numberUcard},{" "}
                        {UserDataStore.user.dateUcard} ,{" "}
                        {UserDataStore.user.cardSide} ЖСН
                        {UserDataStore.user.iin}, екінші тараптан, бірлесіп
                        «тараптар» деп аталып, ақпараттық стендте және
                        Орындаушының тізілімінде, сондай-ақ https://tomo.kz/
                        және https://onkoclinic.com/ веб-сайтта орналастырылған
                        ақылы медициналық қызметтерді көрсету бойынша ашық
                        (жария) оферта Шарты шеңберінде төмендегілер туралы осы
                        медициналық қызметтерді көрсету туралы Шартты (бұдан әрі
                        - Шарт) жасасты:
                    </Text>
                    <Text style={styles.tab}>
                        {" "}
                        1. Шарттың мәні және жалпы ережелері
                    </Text>
                    <Text style={styles.tab}>
                        {" "}
                        1.1. Тапсырыс берушінің өтініші негізінде Орындаушы
                        Пациентке медициналық қызметтердің прейскурантына сәйкес
                        ақылы медициналық консультацияларды және басқа да ақылы
                        медициналық қызметтерді (Қызметтер) көрсетуге
                        міндеттенеді, ал Тапсырыс беруші Қызметтерді осы шарттың
                        талаптарына сәйкес қабылдауға және төлеуге міндеттенеді.
                    </Text>
                    <Text style={styles.tab}>
                        1.2. Орындаушы Орындаушының Қазақстан Республикасы,
                        Астана қаласы, Алматы ауданы, Абылай хан даңғылы, 42/1
                        мекенжайында нақты орналасқан жері бойынша медициналық
                        қызмет көрсетуге міндеттенеді:
                    </Text>
                    <Text style={styles.tab}>2. Төлем тәртібі</Text>
                    <Text style={styles.tab}>
                        2.1. Тапсырыс берушіге/Пациентке көрсетілетін ақылы
                        медициналық қызметтердің құны Пациент жүгінген кездегі
                        ақылы медициналық қызметтердің қолданыстағы Бағалар
                        прейскурантына (Бағалар прейскуранты Томотерапия
                        орталығының қабылдау бөлімінде орналастырылған) сәйкес
                        анықталады.
                    </Text>
                    <Text style={styles.tab}>
                        2.2. Қызметтер толық көлемде алдын ала төленген жағдайда
                        ұсынылады. Тапсырыс беруші/Пациент төлемді Орындаушының
                        қызметтерін алғанға дейін жасауға міндетті. Төлем
                        Қазақстан Республикасының ұлттық валютасында қолма-қол
                        ақшамен де, қолма-қол ақшасыз да жүзеге асырылуы мүмкін.
                    </Text>
                    <Text style={styles.tab}>
                        2.3. Орындаушы Тапсырыс берушіге/Пациентке төлем
                        фактісін растайтын белгіленген үлгідегі құжатты береді.
                        Қызмет көрсету нәтижелері бойынша медициналық құжаттар
                        нақты көрсетілген қызметтердің барлық сомасы төленгеннен
                        кейін беріледі.
                    </Text>
                    <Text style={styles.tab}>
                        2.4. Қызметті көрсету мерзімінен бұрын тоқтатылған
                        жағдайда, Шарт талаптарын Тапсырыс беруші бұзған
                        жағдайларды қоспағанда, Орындаушы Тапсырыс
                        берушіге/Пациентке төленген сома мен нақты көрсетілген
                        қызмет құны арасындағы айырманы төлейді.
                    </Text>
                    <Text style={styles.tab}>
                        2.5. Орындаушының қызметтерін Пациенттер ақылы негізде,
                        мемлекет қаражаты немесе үшінші тұлғалар есебінен ала
                        алады.
                    </Text>
                    <Text style={styles.tab}>
                        {" "}
                        3 Тараптардың жауапкершілігі
                    </Text>
                    <Text style={styles.tab}>3.1. Орындаушы:</Text>
                    <Text style={styles.tab}>
                        - Орындаушының лицензияларына және Қазақстан
                        Республикасындағы денсаулық сақтау саласындағы
                        қолданыстағы нормативтік құқықтық актілерге сәйкес
                        Қызметтерді көрсету ерекшеліктерін ескере отырып,
                        Тапсырыс берушілерге/Пациенттерге ақылы медициналық
                        көмек көрсету бойынша қызметтерді көрсетуге;
                    </Text>
                    <Text style={styles.tab}>
                        - Тапсырыс берушіге/Пациентке осы шарт бойынша
                        медициналық қызметтерді көрсету мерзіміне жарамды
                        бағалар прейскурантымен танысу мүмкіндігін беруге;
                    </Text>
                    <Text style={styles.tab}>
                        - ауруларды диагностикалау мен емдеудің клиникалық
                        хаттамаларына сәйкес, осы нозологиялар бойынша
                        клиникалық хаттамалар болмаған жағдайда – жалпы
                        қабылданған тәсілдерге және медициналық көрсеткіштер
                        бойынша дәлелді медицина негіздеріне сәйкес медициналық
                        қызметтерді көрсетуді қамтамасыз етуге;
                    </Text>
                    <Text style={styles.tab}>
                        - Тапсырыс берушінің/Пациенттің денсаулық жағдайының
                        және оның жеке деректерінің құпиялылығын қамтамасыз
                        етуге;
                    </Text>
                    <Text style={styles.tab}>
                        - медициналық қызмет көрсету кезінде ұйым аумағында
                        қажетті санитарлық-гигиеналық және эпидемияға қарсы
                        тәртіпті сақтауға;
                    </Text>
                    <Text style={styles.tab}>
                        - Тапсырыс берушіге/Пациентке құрметпен және
                        адамгершілікпен қарауға;
                    </Text>
                    <Text style={styles.tab}>
                        - Тапсырыс беруші/Пациент осы шарттың 2-бөлімінде
                        көрсетілген тәртіппен қаражат төлегеннен кейін және
                        төлемді растайтын құжаттарды ұсынғаннан кейін осы шартқа
                        сәйкес толық көлемде заманауи диагностикалық және емдеу
                        әдістерін пайдалана отырып, жоғары сапалы медициналық
                        қызметтерді көрсетуге;
                    </Text>
                    <Text style={styles.tab}>
                        - Тапсырыс берушіге/Пациентке көрсетілетін медициналық
                        қызметтердің түрлерін, көлемдерін, шығындарын, сондай-ақ
                        одан алынған қаражатты, оның ішінде медициналық
                        ақпараттық жүйелерді және есепке алу жүйелерін пайдалана
                        отырып, есепке алуды жүргізуге;
                    </Text>
                    <Text style={styles.tab}>
                        - Тапсырыс берушіге/Пациентке Қазақстан Республикасы
                        Салық кодексінің 412-бабына сәйкес көрсетілген
                        медициналық қызметтердің (көмектің) түрлері мен көлемін
                        көрсете отырып, белгіленген мерзімде шот-фактураны
                        ұсынуға міндетті.
                    </Text>
                    <Text style={styles.tab}> 3.2. Тұтынушы:</Text>
                    <Text style={styles.tab}>
                        - жұмыс тәртібі мен режимін анықтайтын Орындаушы
                        белгілеген ережелерді сақтауға;
                    </Text>
                    <Text style={styles.tab}>
                        - Шарт бойынша медициналық қызмет (көмек) алу кезінде
                        Қазақстан Республикасының заңнамасын сақтауға;
                    </Text>
                    <Text style={styles.tab}>
                        - Шартпен белгіленген медициналық қызметті (көмекті)
                        көрсету күнінен бір немесе бірнеше күн бұрын Орындаушыға
                        медициналық қызметтен (көмектен) немесе медициналық
                        қызметтің (көмектің) бір бөлігін алудан бас тарту туралы
                        хабарлауға;
                    </Text>
                    <Text style={styles.tab}>
                        - Шартта көрсетілген мерзімге сәйкес Орындаушыға
                        көрсетілген медициналық қызметтер (көмек) үшін төлем
                        жасауға міндетті.
                    </Text>
                    <Text style={styles.tab}>4. Тараптардың құқықтары</Text>
                    <Text style={styles.tab}>4.1. Тапсырыс беруші:</Text>
                    <Text style={styles.tab}>
                        - ақылы медициналық қызмет (көмек) көрсететін
                        дәрігерлердің арасынан емдеуші дәрігерді таңдауға.
                    </Text>
                    <Text style={styles.tab}>
                        - «Медициналық көрсетілетін қызметтер (көмек) сапасына
                        ішкі және сыртқы сараптамаларды ұйымдастыру мен жүргізу
                        қағидаларын бекіту туралы» Қазақстан Республикасы
                        Денсаулық сақтау министрінің 2020 жылғы 3 желтоқсандағы
                        № ҚР ДСМ-230/2020 бұйрығына сәйкес көрсетілетін емнің
                        сапасына және медициналық тағайындаулардың негізділігіне
                        сараптама жүргізуге құқылы.
                    </Text>
                    <Text style={styles.tab}>
                        - 4.2. Тапсырыс беруші осы Шартпен белгіленген
                        ережелерді бұзған жағдайда Орындаушы емдеуді мерзімінен
                        бұрын тоқтатуға құқылы.
                    </Text>
                    <Text style={styles.tab}>
                        5. Тараптардың жауапкершілігі
                    </Text>

                    <Text style={styles.tab}>
                        5.1. Орындаушы ақылы медициналық қызметтерді көрсетудегі
                        кез келген бұзушылықтар үшін жауапты:
                    </Text>
                    <Text style={styles.tab}>
                        - сәйкес емес көлемде және сапада медициналық
                        қызметтерді көрсетуге;
                    </Text>
                    <Text style={styles.tab}>
                        - «Әкімшілік құқық бұзушылық туралы» Қазақстан
                        Республикасы Кодексінің 424-бабының 2-тармағына сәйкес
                        тегін медициналық көмектің кепілдік берілген көлемі
                        шеңберіне және (немесе) міндетті әлеуметтік медициналық
                        сақтандыру жүйесіне кіретін қызметтер үшін Тапсырыс
                        берушіден төлем алуға;
                    </Text>
                    <Text style={styles.tab}>
                        - бір медициналық қызметті көрсеткені үшін екі есе ақы
                        алуға (Тапсырыс беруші және бюджет қаражаты есебінен).
                    </Text>
                    <Text style={styles.tab}>
                        5.2. Осы Шартта көзделген міндеттемелерді орындамаған
                        немесе тиісінше орындамаған жағдайда тараптар Қазақстан
                        Республикасының заңнамасына сәйкес жауапкершілікте
                        болады.
                    </Text>
                    <Text style={styles.tab}>
                        5.3. Тапсырыс беруші Орындаушыға нақты көрсетілген
                        медициналық қызметтер (көмек) үшін шығындарды уақытылы
                        өтемегені үшін жауапты болады.
                    </Text>
                    <Text style={styles.tab}>
                        5.4. Тараптар осы Шарт бойынша өз міндеттемелерін
                        орындамаған немесе тиісінше орындамаған жағдайда барлық
                        даулар мен келіспеушіліктер Қазақстан Республикасының
                        қолданыстағы азаматтық заңнамасына сәйкес шешіледі.
                    </Text>
                    <Text style={styles.tab}>6. Форс-мажор</Text>
                    <Text style={styles.tab}>
                        6.1 Тараптар Шарт талаптарын орындамағаны үшін жауапты
                        болмайды, егер ол форс-мажор жағдайлар нәтижесінде орын
                        алса.
                    </Text>
                    <Text style={styles.tab}>
                        6.2 Егер Шартты орындаудың кешігуі форс-мажорлық
                        жағдайлардың салдары болып табылса, Орталық тұрақсыздық
                        айыбын төлеуге немесе оның шарттарын орындамау
                        салдарынан Шарттың бұзылуына жауап бермейді.
                    </Text>
                    <Text style={styles.tab}>
                        6.3 Шарттың мақсаттары үшін «форс-мажор» Тараптардың
                        бақылауынан тыс және күтпеген сипаттағы оқиғаны
                        білдіреді. Мұндай оқиғалар мыналарды қамтуы мүмкін,
                        бірақ олармен шектелмейді: табиғи апаттар, эпидемиялар,
                        әскери әрекеттер, ереуілдер, құзыретті органдардың
                        тиісті шешімдер қабылдауы және т.б.
                    </Text>
                    <Text style={styles.tab}>
                        6.4 Форс-мажорлық мән-жайлар туындаған жағдайда, Өнім
                        беруші бір немесе бірнеше жұмыс күні ішінде Тапсырыс
                        берушіге/Пациентке мұндай жағдайлар мен олардың
                        себептері туралы хабарламаны дереу жіберуге міндетті.
                    </Text>
                    <Text style={styles.tab}>
                        6.5 Егер Тапсырыс берушіден/Пациенттен басқа жазбаша
                        нұсқаулар түспесе, Орталық Шарт бойынша өз
                        міндеттемелерін орындауды жалғастырады және
                        форс-мажорлық жағдайларға тәуелсіз Шартты орындаудың
                        баламалы жолдарын іздейді.
                    </Text>
                    <Text style={styles.tab}>7. Шартты өзгерту және бұзу</Text>
                    <Text style={styles.tab}>
                        7.1. Осы Шарттың талаптары тараптардың жазбаша келісімі
                        бойынша өзгертілуі және толықтырылуы мүмкін.
                    </Text>
                    <Text style={styles.tab}>
                        7.2. Тараптар үш немесе одан да көп жұмыс күні ішінде
                        Шартты бұзу ниеті туралы бір-бірін хабардар етуге
                        міндетті.
                    </Text>
                    <Text style={styles.tab}>
                        7.3. Осы Шартты бұзуға Тараптардың келісімі бойынша
                        немесе Қазақстан Республикасының азаматтық заңнамасында
                        көзделген негіздер бойынша сот шешімімен жол беріледі.
                    </Text>
                    <Text style={styles.tab}>8. Қорытынды шарттар</Text>
                    <Text style={styles.tab}>
                        8.1. Тараптардың ешқайсысы тараптардың жазбаша
                        келісімінсіз осы Шарт бойынша өз міндеттемелерін үшінші
                        тұлғаға беруге құқығы жоқ.
                    </Text>
                    <Text style={styles.tab}>
                        8.2. Осы Шарт оған тараптар қол қойған күннен бастап
                        күшіне енеді және Шартты мерзімінен бұрын бұзуды
                        қоспағанда, тараптардың осы Шарт бойынша барлық
                        міндеттемелері орындалғанға дейін жарамды.
                    </Text>
                    <Text style={styles.tab}>
                        8.3. Осы Шарт бірдей заңды күші бар екі данада жасалды,
                        бір данасы Тапсырыс берушіде, екіншісі Орындаушыда.
                    </Text>
                    <Text style={styles.tab}>
                        Шарт Қазақстан Республикасының азаматтық заңнамасына
                        сәйкес қағаз және электрондық нысанда жасалуы мүмкін.
                    </Text>
                    <Text style={styles.tab}>
                        8.4. Осы Шарттың талаптарын орындауға байланысты
                        Тапсырыс беруші мен Орындаушы арасындағы барлық даулы
                        мәселелер Қазақстан Республикасының азаматтық
                        заңнамасына сәйкес шешіледі.
                    </Text>
                    <Text style={styles.tab}>
                        8.5. Осы Шартта көзделмегендердің барлығында Тараптар
                        Қазақстан Республикасының азаматтық заңнамасын
                        басшылыққа алады.
                    </Text>
                    <Text style={styles.tab2}>
                        9. Тараптардың мекенжайлары мен деректемелері:
                    </Text>
                    <View style={styles.flexeble}>
                        <View style={styles.blocks}>
                            <Text>ОРЫНДАУШЫ:</Text>
                            <Text>
                                «ҮМІТ» Халықаралық онкологиялық томотерапия
                                орталығы» ЖШС
                            </Text>
                            <Text>
                                Мекенжайы: Қазақстан Республикасы, 010000,
                                Астана қ.,{" "}
                            </Text>
                            <Text>Абылай хан даңғылы, 42/1-үй</Text>
                            <Text>БСН: 160440010230 </Text>
                            <Text>ЖСК: KZ896017111000008471</Text>
                            <Text>Банк: «Қазақстанның Халық Банкі» АҚ</Text>
                            <Text>БСК: HSBKKZKX</Text>
                            <Text>e-mail: too.umit@tomo.kz</Text>
                            <Text>
                                тел.: +7 7172 95 44 84, +7 (702) 201 94 44,
                            </Text>
                            <Text>+7 (777) 201 44 44</Text>
                            <Text>Директор:</Text>
                            <Text>___________________ Шаяхметов Е. М.</Text>
                        </View>

                        <View style={styles.blocks}>
                            <Text>ТАПСЫРЫС БЕРУШІ:</Text>
                            <Text>{UserDataStore.user.fio}</Text>
                            <Text>Мекенжайы:{UserDataStore.user.adress}</Text>
                            <Text>ЖСН:{UserDataStore.user.iin}</Text>
                            <Text>e-mail: {UserDataStore.user.Email}</Text>
                            <Text>тел.: {UserDataStore.user.phone}</Text>

                            <Text>
                                Күні {date.getDate()}.{date.getMonth() + 1}.
                                {date.getFullYear()}
                            </Text>
                            <Text>{UserDataStore.user.fio}</Text>

                            <View>
                                {signature && (
                                    <Image
                                        style={styles.image}
                                        src={signature}
                                    />
                                )}
                            </View>
                        </View>
                    </View>
                </View>
            </Page>
        </>
    );
}

function rusDoc(signature) {
    return (
        <>
            <Page style={styles.page}>
                <View style={styles.section}>
                    <Text style={styles.title}>
                        Приложение к договору открытой (публичной) оферты на
                        оказание платных медицинских услуг{" "}
                    </Text>

                    <Text style={styles.title}>
                        Информированное добровольное согласие пациента на
                        оказание платных услуг
                    </Text>

                    <Text style={styles.tab}>
                        Я, пациент/законный представитель :{" "}
                        {UserDataStore.user.fio}, Иин {UserDataStore.user.iin} ,
                        находясь в Международном онкологическом центре
                        томотерапии «ҮМІТ (далее - «Центр»), настоящим
                        подтверждаю, что до получения платной медицинской
                        услуги, Центр в доступной для меня форме ознакомил меня
                        с Правилами оказания платных услуг субъектами
                        здравоохранения, утвержденными Приказом МЗ РК от 29
                        октября 2020 года № ҚР ДСМ-170/2020, я уведомлен\а и
                        согласен с тем, что обследование и лечение в отделении
                        Центра, оказываемое мне на платной основе будет
                        проводиться по моему собственному выбору и желанию, я
                        отказываюсь от бесплатного лечения и гарантирую оплату
                        за оказанные платные медицинские услуги, включая
                        пребывание в стационаре (дневном), также я
                        проинформирован(а) о нижеследующем:
                    </Text>

                    <Text style={styles.tab}>
                        - о моих правах госпитализации и лечения по перечню
                        гарантированного объема бесплатной медицинской помощи,
                        (в соответствии с Постановлением Правительства РК №2136
                        от 28.09.2009 г. «Об утверждении гарантированного объема
                        бесплатной медицинской помощи») и о возможности
                        получения соответствующих видов и объемов медицинской
                        помощи без взимания платы, и добровольно отказываюсь от
                        бесплатного лечения в пользу платного;
                    </Text>
                    <Text style={styles.tab}>
                        - о перечне платных медицинских услуг, предоставляемых
                        Центром о ценах на платные услуги, условиях, форме и
                        порядке их предоставления и оплаты, и со мной
                        согласованы в момент поступления план предварительного
                        обследования и лечения, предварительная сумма оплаты в
                        рамках основного/сопутствующих заболеваний, при этом
                        окончательное согласование по обследованию, лечению и
                        оплате по основному и по сопутствующим заболеваниям
                        будет проводиться в ходе рабочего процесса (в день
                        выписки выставляется к оплате Калькуляции (Акт
                        выполненных работ) и выдается Выписка из медицинской
                        документации, установленного образца);
                    </Text>
                    <Text style={styles.tab}>
                        - о льготах при предоставлении платных услуг для
                        отдельных категорий граждан;
                    </Text>
                    <Text style={styles.tab}>
                        - о медицинских работниках, участвующих в предоставлении
                        платных медицинских услуг, уровне их профессионального
                        образования и квалификации;
                    </Text>
                    <Text style={styles.tab}>
                        - информация о Центре, в том числе, сведения о лицензии
                        Центра на осуществление медицинской деятельности (номер
                        и дата выдачи, перечень подвидов лицензируемого вида
                        деятельности, полное наименование лицензиара), о режиме
                        работы, графике работы медицинских работников,
                        участвующих в предоставлении медицинской помощи в рамках
                        гарантированного объема бесплатной медицинской помощи и
                        (или) в системе обязательного социального медицинского
                        страхования, платных услуг;
                    </Text>
                    <Text style={styles.tab}>
                        - о контролирующих органах: адреса и телефоны
                        уполномоченного органа, местного органа государственного
                        управления здравоохранения столицы, территориальных
                        подразделений государственного органа в сфере оказания
                        медицинских услуг (помощи), территориальных
                        подразделений государственного органа в сфере обращения
                        лекарственных средств и медицинских изделий;
                    </Text>
                    <Text style={styles.tab}>
                        - о целях, характере, факторах риска и возможных
                        осложнениях при оказании платных медицинских услуг;
                    </Text>
                    <Text style={styles.tab}>
                        - что забор необходимых анализов и обследований
                        проводится по существующим требованиям
                        санитарно-эпидемиологического надзора и по показаниям
                        лечащего врача, причем сроки последних принимаемых во
                        внимание должны быть не более 10 дней давности;
                    </Text>
                    <Text style={styles.tab}>
                        - иной информации, предусмотренной правилами
                        предоставления платных медицинских услуг.
                    </Text>
                    <Text style={styles.tab}>
                        Я информирован(а) и согласен, что:
                    </Text>
                    <Text style={styles.tab}>
                        - по показаниям лечащего врача (консилиума) в сложных и
                        спорных диагностических случаях по показаниям и по
                        требованию (мониторинг обследования и ответа на лечение
                        и пр.) допускается более кратное проведение исследований
                        после предварительного согласования и без ущемления моих
                        интересов;
                    </Text>
                    <Text style={styles.tab}>
                        - Центр вправе отказать в платном лечении случае
                        выявления до и во время госпитализации непрофильных
                        заболеваний (инфекционные, психические и др), требующих
                        лечения в специализированных медицинских учреждениях, а
                        также при выявлении соматических декомпенсированных и
                        др. заболеваний, на стадии терминальных осложнений,
                        нуждающиеся паллиативном лечении амбулаторно по месту
                        жительства;
                    </Text>
                    <Text style={styles.tab}>
                        - при возникновении и экстренных угрожаемых состояний о
                        переводе в рамках ГОБМП в ургентные клиники г. Астана, а
                        в случае отказа - о возможности перевода в отделы
                        клиники, оказывающих неотложную медицинскую помощь;
                    </Text>
                    <Text style={styles.tab}>
                        - в случае возникновения во время обследования и лечения
                        непредвиденных осложнений, угрожающих моему здоровью,
                        даю согласие на изменение характера лечения (в том числе
                        объема оперативного вмешательства), включая отказ от его
                        выполнения, с последующим информированием меня об этом;
                    </Text>
                    <Text style={styles.tab}>
                        - Центр вправе по обоснованной причине заменить лечащего
                        врача с уведомлением посредством телефонной связи не
                        позже чем за 2 (два) часа до времени и даты приема, я
                        подтверждаю, что вправе отказаться от замены, уведомив
                        Центр, либо перенести прием на другой день\время по
                        согласованию с Центром, каких-либо претензий к Центру
                        ввиду замены врача в указанных случаях иметь не буду.
                    </Text>
                    <Text style={styles.tab}>
                        - возможна передача информации, в рамках оказания
                        платных медицинских услуг посредством телефонных
                        обращений или электронной почты, указанных при
                        заполнении заявления. Электронная почта{" "}
                        {UserDataStore.user.Email}
                    </Text>
                    <Text style={styles.tab}>
                        Я предупрежден(а), что несоблюдение указаний
                        (рекомендаций) Центра (медицинского работника,
                        предоставляющего платную медицинскую услугу), в том
                        числе назначенного режима лечения, может снизить
                        качество предоставляемой платной медицинской услуги,
                        повлечь за собой невозможность ее завершения в срок или
                        отрицательно сказаться на состоянии здоровья. Настоящим
                        я гарантирую, что мною добровольно, своей волей и в
                        своем интересе, без какого-либо принуждения, выбраны
                        виды платных медицинских услуг, которые я хочу получить
                        в Центре, я ознакомлен (-а) с действующим прейскурантом
                        на платные медицинские и иные платные услуги в Центре и
                        согласен(-на) их оплатить в соответствии с ним, в
                        дальнейшем каких-либо претензий как материального так и
                        нематериального характера к Центру в связи с взиманием
                        платы за услуги иметь не буду.
                    </Text>
                    <Text style={styles.tab}>
                        Я удостоверяю, что текст настоящего информированного
                        согласия мною прочитан, подписан после проведения
                        разъяснительной беседы, его положения мне понятны, я даю
                        свое согласие на получение и оплату платных медицинских
                        и иных платных услуг в Центре, и подтверждаю дачу
                        согласия Центру на сбор, обработку, передачу необходимых
                        персональных данных, в объеме и способами согласно
                        законодательству Республики Казахстан.
                    </Text>
                    <Text style={styles.tab}>
                        Настоящее информированное добровольное согласие на
                        оказание платных медицинских услуг принимается акцептом
                        и является неотъемлемой частью Договора открытой
                        (публичной) оферты на оказание платных медицинских
                        услуг, который принимается Заказчиком/Пациентом путем
                        присоединения к указанному Договору в целом без
                        каких-либо условий, изъятий и оговорок.
                    </Text>
                    <Text style={styles.tab}>
                        Я получил(а) экземпляр настоящего Информированного
                        согласия пациента на оказание платных услуг.
                    </Text>

                    <Text style={styles.marginTop}>
                        Дата {date.getDate()}.{date.getMonth() + 1}.
                        {date.getFullYear()}
                    </Text>
                    <Text>{UserDataStore.user.fio}</Text>

                    {signature && (
                        <Image style={styles.image} src={signature} />
                    )}
                </View>
            </Page>
            <Page style={styles.page}>
                <View style={styles.section}>
                    <Text style={styles.title}>
                        ДОГОВОР № _____ по предоставлению платных медицинских
                        услуг (помощи)
                    </Text>
                    <Text style={styles.tab}>
                        ТОО «Международный онкологический исполнитель
                        томотерапии «ҮМІТ», (далее – Исполнитель) в лице
                        Директора Шаяхметова Е.М., действующего на основании
                        Устава, с одной стороны, и {UserDataStore.user.fio} ,
                        именуемый/-ая в дальнейшем «Заказчик»/«Пациент»,{" "}
                        {UserDataStore.user.data} года рождения, удостоверение
                        личности (паспорт) № {UserDataStore.user.numberUcard}{" "}
                        выданное {UserDataStore.user.dateUcard} ,{" "}
                        {UserDataStore.user.cardSide} , с другой стороны,
                        совместно именуемые «Стороны», в рамках Договора
                        открытой (публичной) оферты на оказание платных
                        медицинских услуг, размещенного на информационном стенде
                        и в регистратуре Исполнителя, а также на сайте:
                        https://tomo.kz/ и https://onkoclinic.com/, заключили
                        настоящий договор на оказание медицинских услуг (далее –
                        Договор) о нижеследующем:
                    </Text>
                    <Text style={styles.tab}>1. Предмет Договора</Text>
                    <Text style={styles.tab}>
                        {" "}
                        1.1. Исполнитель на основании обращения Заказчика
                        обязуется оказать ему Пациенту платные медицинские
                        консультации и иные платные медицинские услуги (Услуги)
                        в соответствии с прейскурантом медицинских услуг, а
                        Заказчик обязуется принять и оплатить Услуги в
                        соответствии с условиями настоящего Договора.
                    </Text>
                    <Text style={styles.tab}>
                        1.2. Исполнитель обязуется оказать медицинские услуги по
                        фактическому месту нахождения Исполнителя: Республика
                        Казахстан, г. Астана, район Алматы, пр.Абылай Хана,
                        д.42/1.
                    </Text>
                    <Text style={styles.tab}>2. Порядок оплаты</Text>
                    <Text style={styles.tab}>
                        2.1. Стоимость платных медицинских услуг, оказываемых
                        Заказчику/Пациенту, определяется в соответствии с
                        действующим Прейскурантом платных медицинских услуг
                        (Прейскурант цен размещен на Ресепшне Исполнителя
                        томотерапии) на момент обращения Пациента.
                    </Text>
                    <Text style={styles.tab}>
                        2.2. Оказание Услуг происходит при условии их предоплаты
                        в полном объеме. Заказчик/Пациент обязан оплатить услуги
                        Исполнителя перед их получением. Расчет может быть
                        произведен как наличными деньгами, так и безналичным
                        способом, в национальной валюте Республики Казахстан.
                    </Text>
                    <Text style={styles.tab}>
                        2.3. Исполнитель выдает Заказчику/Пациенту документ
                        установленного образца, подтверждающего факт оплаты.
                        Медицинские документы по результатам оказания услуг
                        выдаются после оплаты всей суммы фактически оказанных
                        Услуг.
                    </Text>
                    <Text style={styles.tab}>
                        2.4. В случае досрочного прекращения оказания Услуги
                        Исполнитель выплачивает Заказчику/Пациенту разницу между
                        оплаченной суммой и стоимостью фактически оказанной
                        услуги, за исключением случаев нарушения условий
                        Договора Заказчиком/Пациентом.
                    </Text>
                    <Text style={styles.tab}>
                        2.5. Услуги Исполнителя могут быть получены Пациентами
                        на платной основе, за счет средств государственного
                        заказа или третьих лиц.
                    </Text>
                    <Text style={styles.tab}>3. Обязанности сторон</Text>
                    <Text style={styles.tab}>3.1. Исполнитель обязан:</Text>
                    <Text style={styles.tab}>
                        - предоставить услуги по оказанию платной медицинской
                        помощи Заказчикам/Пациентам, в соответствии с имеющимися
                        у Исполнителя лицензиями и действующими нормативными
                        правовыми актами о здравоохранении в Республике
                        Казахстан, с учетом специфики оказания Услуг;
                    </Text>
                    <Text style={styles.tab}>
                        - предоставить Заказчику/Пациенту возможность
                        ознакомиться с Прейскурантом цен, действующим на период
                        оказания медицинских услуг по настоящему договору;
                    </Text>
                    <Text style={styles.tab}>
                        - обеспечить оказание медицинских Услуг в соответствии с
                        клиническими протоколами диагностики и лечения
                        заболеваний, при отсутствии клинических протоколов по
                        данным нозологиям – в соответствии с общепринятыми
                        подходами и базой доказательной медицины по медицинским
                        показаниям;
                    </Text>
                    <Text style={styles.tab}>
                        - обеспечить режим конфиденциальности состояния здоровья
                        Заказчика/Пациента и его персональных данных;
                    </Text>
                    <Text style={styles.tab}>
                        - поддерживать необходимый санитарно-гигиенический и
                        противоэпидемический порядок на своей территории
                        организации при оказании медицинских услуг;
                    </Text>
                    <Text style={styles.tab}>
                        - уважительно и гуманно относиться к Заказчику/Пациенту;
                    </Text>
                    <Text style={styles.tab}>
                        - оказывать медицинские услуги качественно, с
                        использованием современных методов диагностики и
                        лечения, в полном объеме в соответствии с настоящим
                        договором после внесения Заказчиком/Пациентом денежных
                        средств в порядке, определенном разделом 2. настоящего
                        договора, и предоставления документов, подтверждающих
                        оплату;
                    </Text>
                    <Text style={styles.tab}>
                        - вести учет видов, объемов, стоимости, оказанных
                        Заказчику/Пациенту медицинских услуг, а также денежных
                        средств, поступивших от него, в том числе с
                        использованием медицинских информационных систем и
                        бухгалтерских систем;
                    </Text>
                    <Text style={styles.tab}>
                        - предоставлять Заказчику/Пациенту счет-фактуру согласно
                        статье 412 Налогового кодекса Республики Казахстан, с
                        указанием видов и объема оказанных медицинских услуг
                        (помощи), в установленные сроки.
                    </Text>
                    <Text style={styles.tab}>3.2. Заказчик обязан:</Text>
                    <Text style={styles.tab}>
                        - соблюдать правила, установленные Исполнителем,
                        определяющие порядок и режим работы;
                    </Text>
                    <Text style={styles.tab}>
                        - соблюдать законодательство Республики Казахстан при
                        получении медицинской услуги (помощи) по Договору;
                    </Text>
                    <Text style={styles.tab}>
                        - информировать Исполнителя об отказе в получении
                        медицинской услуги (помощи) или части медицинской услуги
                        (помощи) за один и более дня до наступления даты
                        оказания медицинской услуги (помощи), установленной
                        Договором;
                    </Text>
                    <Text style={styles.tab}>
                        - производить оплату Исполнителю, за оказанные
                        медицинские услуги (помощи), согласно указанным срокам в
                        Договоре.
                    </Text>
                    <Text style={styles.tab}>4. Права сторон</Text>
                    <Text style={styles.tab}>4.1. Заказчик имеет право:</Text>
                    <Text style={styles.tab}>
                        - выбора лечащего врача из числа врачей, оказывающих
                        платные медицинские услуги (помощи);
                    </Text>
                    <Text style={styles.tab}>
                        - на осуществление экспертизы качества проведенного
                        лечения и обоснованности врачебных назначений согласно
                        приказу Министра здравоохранения Республики Казахстан от
                        3 декабря 2020 года № ҚР ДСМ-230/2020 "Об утверждении
                        правил организации и проведения внутренней и внешней
                        экспертиз качества медицинских услуг (помощи)"
                        (зарегистрирован в Реестре государственной регистрации
                        нормативных правовых актов под № 21727).
                    </Text>
                    <Text style={styles.tab}>
                        - 4.2. Исполнитель имеет право на досрочное прекращение
                        лечения в случае нарушения Заказчиком правил,
                        установленных настоящим Договором.
                    </Text>
                    <Text style={styles.tab}>5. Ответственность сторон</Text>

                    <Text style={styles.tab}>
                        5.1. Исполнитель несет ответственность за допущенные
                        случаи нарушения по оказанию платных медицинских услуг:
                    </Text>
                    <Text style={styles.tab}>
                        - оказание медицинских услуг ненадлежащего объема и
                        качества;
                    </Text>
                    <Text style={styles.tab}>
                        - взимание платы с Заказчика за услуги, входящие в
                        гарантированный объем бесплатной медицинской помощи и
                        (или) в систему обязательного социального медицинского
                        страхования, в соответствии с пунктом 2 статьи 424
                        Кодекса Республики Казахстан "Об административных
                        правонарушениях";
                    </Text>
                    <Text style={styles.tab}>
                        - взимание двойной платы за оказание одной и той же
                        медицинской услуги (за счет средств Заказчика и
                        бюджетных средств).
                    </Text>
                    <Text style={styles.tab}>
                        5.2. В случае неисполнения или ненадлежащего исполнения
                        обязательств, предусмотренных настоящим Договором,
                        стороны несут ответственность в соответствии с законами
                        Республики Казахстан.
                    </Text>
                    <Text style={styles.tab}>
                        5.3. Заказчик несет ответственность за несвоевременное
                        возмещение затрат Исполнителю за фактически оказанные
                        медицинские услуги (помощи).
                    </Text>
                    <Text style={styles.tab}>
                        5.4. В случае невыполнения или ненадлежащего выполнения
                        Сторонами своих обязательств в рамках настоящего
                        Договора все споры и разногласия разрешаются в
                        соответствии с действующим гражданским законодательством
                        Республики Казахстан.
                    </Text>
                    <Text style={styles.tab}>6. Форс-мажор</Text>
                    <Text style={styles.tab}>
                        6.1 Стороны не несут ответственность за неисполнение
                        условий Договора, если оно явилось результатом
                        форс-мажорных обстоятельств.
                    </Text>
                    <Text style={styles.tab}>
                        6.2 Центр не несет ответственность за выплату неустоек
                        или расторжение Договора в силу неисполнения его
                        условий, если задержка с исполнением Договора является
                        результатом форс-мажорных обстоятельств.
                    </Text>
                    <Text style={styles.tab}>
                        6.3 Для целей Договора «форс-мажор» означает событие,
                        неподвластное контролю Сторон, и имеющее непредвиденный
                        характер. Такие события могут включат, но не
                        исключительно: стихийные бедствия, эпидемии, военные
                        действия, забастовки, принятие компетентными органами
                        соответствующих решений и другие.
                    </Text>
                    <Text style={styles.tab}>
                        6.4 При возникновении форс-мажорных обстоятельств Центр
                        должен незамедлительно в течении одного и более рабочих
                        дней направить Заказчику\Пациенту уведомление о таких
                        обстоятельствах и их причинах.
                    </Text>
                    <Text style={styles.tab}>
                        6.5 Если от Заказчика\Пациента не поступает иных
                        письменных инструкций, Центр продолжает выполнять свои
                        обязательства по Договору, насколько это целесообразно,
                        и ведет поиск альтернативных способов выполнения
                        Договора, не зависящих от форс-мажорных обстоятельств.
                    </Text>
                    <Text style={styles.tab}>
                        7. Изменение и расторжение Договора
                    </Text>
                    <Text style={styles.tab}>
                        7.1. Условия настоящего Договора могут быть изменены и
                        дополнены по письменному соглашению сторон.
                    </Text>
                    <Text style={styles.tab}>
                        7.2. О намерении досрочного расторжения Договора стороны
                        обязаны уведомить друг друга в течении трех и более
                        рабочих дней.
                    </Text>
                    <Text style={styles.tab}>
                        7.3. Расторжение настоящего Договора допускается по
                        соглашению Сторон или по решению суда по основаниям,
                        предусмотренным гражданским законодательством Республики
                        Казахстан.
                    </Text>
                    <Text style={styles.tab}>8. Заключительные положения</Text>
                    <Text style={styles.tab}>
                        8.1. Ни одна из сторон не имеет право передавать свои
                        обязательства по настоящему Договору третьей стороне без
                        письменного согласия сторон.
                    </Text>
                    <Text style={styles.tab}>
                        8.2. Настоящий Договор вступает в силу со дня подписания
                        его сторонами и действует до момента исполнения всех
                        обязательств сторон по настоящему Договору, за
                        исключением досрочного прекращения Договора.
                    </Text>
                    <Text style={styles.tab}>
                        8.3. Настоящий Договор составлен в двух экземплярах,
                        имеющих одинаковую юридическую силу, один экземпляр
                        находится у Заказчика, другой – у Исполнителя.
                    </Text>
                    <Text style={styles.tab}>
                        Договор может заключаться в бумажном и электронном виде
                        в соответствии с гражданским законодательством
                        Республики Казахстан.
                    </Text>
                    <Text style={styles.tab}>
                        8.4. Все спорные вопросы между Заказчиком и
                        Исполнителем, связанные с исполнением условий настоящего
                        Договора, разрешаются в соответствии с гражданским
                        законодательством Республики Казахстан.
                    </Text>
                    <Text style={styles.tab}>
                        8.5. Во всем, что не предусмотрено настоящим Договором,
                        Стороны руководствуются гражданским законодательством
                        Республики Казахстан.
                    </Text>
                    <Text style={styles.tab2}>
                        9. Адреса и реквизиты Сторон:
                    </Text>
                    <View style={styles.flexeble}>
                        <View style={styles.blocks}>
                            <Text>ИСПОЛНИТЕЛЬ:</Text>
                            <Text>
                                ТОО «Международный онкологический центр
                                томотерапии «ҮМІТ»
                            </Text>
                            <Text>Адрес: Республика Казахстан, 010000, г.</Text>
                            <Text>Астана, пр. Абылай хана, д. 42/1</Text>
                            <Text>БИН: 160440010230</Text>
                            <Text>ИИК: KZ896017111000008471</Text>
                            <Text>Банк: АО «Народный Банк Казахстана»</Text>
                            <Text>БИК: HSBKKZKX</Text>
                            <Text>e-mail: too.umit@tomo.kz</Text>
                            <Text>
                                тел.: +7 7172 95 44 84, +7 (702) 201 94 44,
                            </Text>
                            <Text>+7 (777) 201 44 44</Text>
                            <Text>Директор:</Text>
                            <Text>___________________ Шаяхметов Е. М.</Text>
                        </View>

                        <View style={styles.blocks}>
                            <Text>ЗАКАЗЧИК:</Text>
                            <Text>{UserDataStore.user.fio}</Text>
                            <Text>Адрес:{UserDataStore.user.adress}</Text>
                            <Text>ИИН:{UserDataStore.user.iin}</Text>
                            <Text>e-mail: {UserDataStore.user.Email}</Text>
                            <Text>тел.: {UserDataStore.user.phone}</Text>

                            <Text>
                                Дата {date.getDate()}.{date.getMonth() + 1}.
                                {date.getFullYear()}
                            </Text>
                            <Text>{UserDataStore.user.fio}</Text>

                            <View>
                                {signature && (
                                    <Image
                                        style={styles.image}
                                        src={signature}
                                    />
                                )}
                            </View>
                        </View>
                    </View>
                </View>
            </Page>
        </>
    );
}
function enDoc(signature) {
    return (
        <>
            <Page style={styles.page}>
                <View style={styles.section}>
                    <Text style={styles.title}>
                        Appendix to the public offer agreement for the provision
                        of paid medical services
                    </Text>

                    <Text style={styles.title}>
                        Informed voluntary consent of the patient for paid
                        services
                    </Text>

                    <Text style={styles.tab}>
                        I, the patient/legal representative:{" "}
                        {UserDataStore.user.fio}, IIN {UserDataStore.user.iin},
                        being in "UMIT" International Oncological Center of
                        Tomotherapy" LLP (hereinafter referred to as the
                        "Center"),hereby confirm that before receiving paid
                        medical services, the Center in an accessible form
                        acquainted me with the Rules for the provision of paid
                        services by healthcare entities approved by Order of the
                        Ministry of Healthcare of the Republic of Kazakhstan
                        dated October 29, 2020 No. KR DSM-170/2020, and I am
                        notified and agree that the examination and treatment in
                        the department of the Center, provided to me on a paid
                        basis, will be carried out at my own choice and desire,
                        I refuse free treatment and guarantee payment for paid
                        medical services provided, including (day) hospital
                        stay, I am also informed of the following:
                    </Text>

                    <Text style={styles.tab}>
                        - my rights of hospitalization and treatment according
                        to the list of guaranteed volume of free medical care,
                        (in accordance with the Decree of the Government of the
                        Republic of Kazakhstan No. 2136 dated 09/28/2009 "On the
                        approval of the guaranteed volume of free medical care")
                        and the possibility of obtaining appropriate types and
                        volumes of medical care without charging, and I
                        voluntarily refuse free treatment in favor of paid;
                    </Text>
                    <Text style={styles.tab}>
                        - the list of paid medical services provided by the
                        Center, prices for paid services, conditions, form and
                        procedure for their provision and payment, and a
                        preliminary examination and treatment plan, a
                        preliminary amount of payment within the framework of
                        the main / concomitant diseases were agreed with me at
                        the time of receipt, while the final agreement on
                        examination, treatment and payment for the main and for
                        concomitant diseases will be carried out during the
                        workflow (on the day of discharge, a Calculation
                        (Certificate if Completion) is issued for payment and an
                        Extract from the medical documentation of the
                        established sample is issued);
                    </Text>
                    <Text style={styles.tab}>
                        - the benefits of providing paid services for certain
                        categories of citizens;
                    </Text>
                    <Text style={styles.tab}>
                        - medical workers involved in the provision of paid
                        medical services, their level of professional education
                        and qualifications;
                    </Text>
                    <Text style={styles.tab}>
                        - information about the Center, including information
                        about the Center's license to carry out medical
                        activities (number and date of issue, list of subtypes
                        of the licensed type of activity, full name of the
                        licensor), about the working hours, work schedule of
                        medical workers involved in providing medical care
                        within the guaranteed volume of free medical care and
                        (or) in the system of compulsory social health
                        insurance, paid services;
                    </Text>
                    <Text style={styles.tab}>
                        - the regulatory authorities: addresses and phone
                        numbers of the authorized body, the local body of the
                        state health administration of the capital, territorial
                        divisions of the state body in the field of medical
                        services (assistance), territorial divisions of the
                        state body in the field of circulation of medicines and
                        medical devices;
                    </Text>
                    <Text style={styles.tab}>
                        - the goals, nature, risk factors and possible
                        complications in the provision of paid medical services;
                    </Text>
                    <Text style={styles.tab}>
                        - that the collection of necessary analyzes and
                        examinations is carried out according to the existing
                        requirements of sanitary and epidemiological supervision
                        and according to the indications of the attending
                        physician, and the timing of the latter taken into
                        account should be no more than 10 days ago;
                    </Text>
                    <Text style={styles.tab}>
                        - other information provided by the rules for the
                        provision of paid medical services.
                    </Text>
                    <Text style={styles.tab}>
                        I am informed and agree that:
                    </Text>
                    <Text style={styles.tab}>
                        - according to the testimony of the attending physician
                        (council), in complex and controversial diagnostic
                        cases, according to indications and on demand
                        (monitoring of examination and response to treatment,
                        etc.), more than one study is allowed after prior
                        approval and without prejudice to my interests;
                    </Text>
                    <Text style={styles.tab}>
                        - The Center has the right to refuse paid treatment in
                        case of detection before and during hospitalization of
                        non-core diseases (infectious, mental, etc.) requiring
                        treatment in specialized medical institutions, as well
                        as in the detection of somatic decompensated and other
                        diseases, at the stage of terminal complications,
                        requiring palliative treatment on an outpatient basis at
                        the place of residence;
                    </Text>
                    <Text style={styles.tab}>
                        - in case of emergency and threatened conditions, about
                        transfer within the framework of the guaranteed volume
                        of free medical care to urgent clinics in Astana, and in
                        case of refusal - about the possibility of transfer to
                        departments of the clinic providing emergency medical
                        care;
                    </Text>
                    <Text style={styles.tab}>
                        - in case of unforeseen complications that threaten my
                        health during the examination and treatment, I give my
                        consent to change the nature of treatment (including the
                        scope of surgery), including refusal to perform it, and
                        then inform me about it;
                    </Text>
                    <Text style={styles.tab}>
                        - The Center has the right, for a reasonable reason, to
                        replace the attending physician with notification by
                        telephone no later than 2 (two) hours before the time
                        and date of admission, I confirm that I have the right
                        to refuse replacement by notifying the Center, or to
                        postpone the appointment to another day \ time in
                        agreement with the Center, I will not have any claims
                        against the Center due to the replacement of a doctor in
                        these cases.
                    </Text>
                    <Text style={styles.tab}>
                        - it is possible to transfer information as part of the
                        provision of paid medical services through telephone
                        calls or e-mail specified when filling out the
                        application. Email address {UserDataStore.user.Email}
                    </Text>
                    <Text style={styles.tab}>
                        I am warned that non-compliance with the instructions
                        (recommendations) of the Center (a medical professional
                        providing a paid medical service), including the
                        prescribed treatment regimen, may reduce the quality of
                        the paid medical service provided, entail the inability
                        to complete it on time or adversely affect the state of
                        health. I hereby guarantee that I have voluntarily and
                        in my interest, without any compulsion, selected the
                        types of paid medical services that I want to receive at
                        the Center, I have read the current price list for paid
                        medical and other paid services at the Center and agree
                        to pay for them in accordance with it, in the future I
                        will not have any claims, both material and
                        non-material, against the Center in connection with
                        charging for services.
                    </Text>
                    <Text style={styles.tab}>
                        I certify that the text of this informed consent has
                        been read by me, signed after an explanatory
                        conversation, its provisions are clear to me, I give my
                        consent to receive and pay for paid medical and other
                        paid services at the Center, and confirm giving consent
                        to the Center to collect, process, transfer the
                        necessary personal data, to the extent and in accordance
                        with the legislation of the Republic of Kazakhstan.
                    </Text>
                    <Text style={styles.tab}>
                        This informed voluntary consent to the provision of paid
                        medical services is accepted by acceptance and is an
                        integral part of the Contract of a public offer for the
                        provision of paid medical services, which is accepted by
                        the Customer/Patient by joining the specified Contract
                        as a whole without any conditions, exceptions and
                        reservations.
                    </Text>
                    <Text style={styles.tab}>
                        I received a copy of this Informed Consent of the
                        patient for the provision of paid services.
                    </Text>

                    <Text style={styles.marginTop}>
                        Date {date.getDate()}.{date.getMonth() + 1}.
                        {date.getFullYear()}
                    </Text>
                    <Text>{UserDataStore.user.fio}</Text>

                    {signature && (
                        <Image style={styles.image} src={signature} />
                    )}
                </View>
            </Page>
            <Page style={styles.page}>
                <View style={styles.section}>
                    <Text style={styles.title}>
                        CONTRACT No. _____ for the provision of paid medical
                        services (assistance)
                    </Text>
                    <Text style={styles.tab}>
                        "UMIT" International Oncological Center of Tomotherapy"
                        LLP, (hereinafter referred to as the Contractor)
                        represented by Director Ye.M. Shayakhmetov, acting on
                        the basis of the Charter, on the one hand, and
                        {UserDataStore.user.fio}, hereinafter referred to as the
                        "Customer"/"Patient", born on {UserDataStore.user.data},
                        ID card (passport) No. {UserDataStore.user.numberUcard}{" "}
                        issued {UserDataStore.user.dateUcard},{" "}
                        {UserDataStore.user.cardSide}, IIN{" "}
                        {UserDataStore.user.iin}, on the other hand,
                        collectively referred to as the "Parties", within the
                        framework of a Public Offer Agreement for the provision
                        of paid medical services, posted on the the Contractor's
                        information stand and at the registry, as well as on the
                        website: https://tomo.kz / and https://onkoclinic.com /,
                        have concluded this contract for the provision of
                        medical services (hereinafter referred to as the
                        Contract) about the following:
                    </Text>
                    <Text style={styles.tab}>1. Предмет Договора</Text>
                    <Text style={styles.tab}>
                        1.1. The Contractor, based on the Customer's request,
                        undertakes to provide paid medical consultations and
                        other paid medical services (Services) to the Patient in
                        accordance with the price list of medical services, and
                        the Customer undertakes to accept and pay for Services
                        in accordance with the terms hereof.
                    </Text>
                    <Text style={styles.tab}>
                        1.2. The Contractor undertakes to provide medical
                        services at the actual location of the Contractor:
                        Republic of Kazakhstan, Astana, Almaty district, Abylai
                        Khan Ave., 42/1.
                    </Text>
                    <Text style={styles.tab}>2. Payment Procedure</Text>
                    <Text style={styles.tab}>
                        2.1. The cost of paid medical services provided to the
                        Customer/Patient is determined in accordance with the
                        current Price List of paid medical services (the Price
                        List is posted at the Reception of the Tomotherapy
                        Contractor) at the time of the Patient's treatment.
                    </Text>
                    <Text style={styles.tab}>
                        2.2. The provision of Services is subject to full
                        prepayment. The Customer/Patient is obliged to pay for
                        the Services of the Contractor before receiving them.
                        The payment can be made both in cash and non-cash, in
                        the national currency of the Republic of Kazakhstan.
                    </Text>
                    <Text style={styles.tab}>
                        2.3. The Contractor issues to the Customer/Patient a
                        document of the established sample confirming the fact
                        of payment. Medical documents based on the results of
                        the provision of Services are issued after payment of
                        the entire amount of Services actually rendered.
                    </Text>
                    <Text style={styles.tab}>
                        2.4. The Contractor issues to the Customer/Patient a
                        document of the established sample confirming the fact
                        of payment. Medical documents based on the results of
                        the provision of Services are issued after payment of
                        the entire amount of Services actually rendered.
                    </Text>
                    <Text style={styles.tab}>
                        2.5. The Services of the Contractor can be obtained by
                        Patients on a paid basis, at the expense of the state
                        order or third parties.
                    </Text>
                    <Text style={styles.tab}>
                        3. Obligations of the Parties
                    </Text>
                    <Text style={styles.tab}>
                        3.1. The Contractor is obliged to:
                    </Text>
                    <Text style={styles.tab}>
                        - provide services for the provision of paid medical
                        care to Customers/Patients, in accordance with the
                        licenses available to the Contractor and the current
                        regulatory legal acts on healthcare in the Republic of
                        Kazakhstan, taking into account the specifics of the
                        provision of Services;
                    </Text>
                    <Text style={styles.tab}>
                        - provide to the Customer/Patient an opportunity to get
                        acquainted with the Price List valid for the period of
                        provision of medical services hereunder;
                    </Text>
                    <Text style={styles.tab}>
                        - ensure the provision of medical Services in accordance
                        with clinical protocols for the diagnosis and treatment
                        of diseases, in the absence of clinical protocols for
                        these nosologies – in accordance with generally accepted
                        approaches and the base of evidence-based medicine for
                        medical indications;
                    </Text>
                    <Text style={styles.tab}>
                        - ensure confidentiality of the Customer's/Patient's
                        health status and his/her personal data;
                    </Text>
                    <Text style={styles.tab}>
                        - maintain the necessary sanitary and hygienic and
                        anti-epidemic order on the territory of the organization
                        when providing medical services;
                    </Text>
                    <Text style={styles.tab}>
                        - treat the Customer/Patient with respect and humanity;
                    </Text>
                    <Text style={styles.tab}>
                        - provide medical services with high quality, using
                        modern methods of diagnosis and treatment, in full in
                        accordance herewith after the Customer/Patient has made
                        a payment in accordance with the procedure specified in
                        Section 2 hereof, and provided documents confirming
                        payment;
                    </Text>
                    <Text style={styles.tab}>
                        - keep records of the types, volumes, and costs of the
                        medical services provided to the Customer/Patient, as
                        well as funds received from him/her, including using
                        medical information systems and accounting systems;
                    </Text>
                    <Text style={styles.tab}>
                        - provide to the Customer/Patient an invoice in
                        accordance with Article 412 of the Tax Code of the
                        Republic of Kazakhstan, indicating the types and volume
                        of medical services (assistance) provided, within the
                        established time frame.
                    </Text>
                    <Text style={styles.tab}>
                        3.2. The Customer is obliged to:
                    </Text>
                    <Text style={styles.tab}>
                        - comply with the rules established by the Contractor,
                        which determine the order and mode of operation;
                    </Text>
                    <Text style={styles.tab}>
                        - comply with the legislation of the Republic of
                        Kazakhstan when receiving medical services (assistance)
                        under the Contract;
                    </Text>
                    <Text style={styles.tab}>
                        - inform the Contractor about the refusal to receive
                        medical services (assistance) or part of medical
                        services (assistance) one or more days before the date
                        of provision of medical services (assistance)
                        established by the Contract;
                    </Text>
                    <Text style={styles.tab}>
                        - make payments to the Contractor for the medical
                        services (assistance) provided, according to the terms
                        specified in the Contract.
                    </Text>
                    <Text style={styles.tab}>4. Rights of the parties</Text>
                    <Text style={styles.tab}>
                        4.1. The Customer has the right to:
                    </Text>
                    <Text style={styles.tab}>
                        - select the attending physician from among the doctors
                        providing paid medical services (assistance);
                    </Text>
                    <Text style={styles.tab}>
                        - carry out an examination of the quality of treatment
                        and the validity of medical prescriptions in accordance
                        with the order of the Minister of Health of the Republic
                        of Kazakhstan dated December 3, 2020 No. KR DSM-230/2020
                        "On approval of the rules for organizing and conducting
                        internal and external examinations of the quality of
                        medical services (assistance)" (registered in the
                        Register of State Registration of Regulatory Legal Acts
                        under No. 21727).
                    </Text>
                    <Text style={styles.tab}>
                        - 4.2. The Contractor has the right to early termination
                        of treatment in case of violation by the Customer of the
                        rules established hereby.
                    </Text>
                    <Text style={styles.tab}>
                        5. Responsibility of the parties
                    </Text>

                    <Text style={styles.tab}>
                        5.1. The Contractor is responsible for the violations
                        committed in the provision of paid medical services:
                    </Text>
                    <Text style={styles.tab}>
                        - provision of medical services of inadequate volume and
                        quality;
                    </Text>
                    <Text style={styles.tab}>
                        - charging the Customer for services included in the
                        guaranteed amount of free medical care and (or) in the
                        system of compulsory social health insurance, in
                        accordance with paragraph 2 of Article 424 of the Code
                        of the Republic of Kazakhstan "On Administrative
                        Offenses";
                    </Text>
                    <Text style={styles.tab}>
                        - charging double fees for the provision of the same
                        medical service (at the expense of the Customer and
                        budget funds).
                    </Text>
                    <Text style={styles.tab}>
                        5.2. In case of non-fulfillment or improper fulfillment
                        of obligations provided for herein, the parties shall be
                        liable in accordance with the laws of the Republic of
                        Kazakhstan.
                    </Text>
                    <Text style={styles.tab}>
                        5.3. The Customer is responsible for late reimbursement
                        of costs to the Contractor for the medical services
                        (assistance) actually provided.
                    </Text>
                    <Text style={styles.tab}>
                        5.4. In case of non-fulfillment or improper fulfillment
                        by the Parties of their obligations under this
                        Agreement, all disputes and disagreements are resolved
                        in accordance with the current civil legislation of the
                        Republic of Kazakhstan.
                    </Text>
                    <Text style={styles.tab}>6. Force majeure</Text>
                    <Text style={styles.tab}>
                        6.1 The Parties are not responsible for non-fulfillment
                        of the terms hereof if it was the result of force
                        majeure.
                    </Text>
                    <Text style={styles.tab}>
                        6.2 The Center is not responsible for the payment of
                        penalties or termination of the Contract due to
                        non-fulfillment of its terms, if the delay in the
                        execution hereof is the result of force majeure.
                    </Text>
                    <Text style={styles.tab}>
                        6.3 For the purposes hereof, "force majeure" means an
                        event beyond the control of the Parties and having an
                        unforeseen character. Such events may include, but not
                        exclusively: natural disasters, epidemics, military
                        actions, strikes, appropriate decision-making by
                        competent authorities, and others.
                    </Text>
                    <Text style={styles.tab}>
                        6.4 In case of force majeure, the Center must
                        immediately, within one or more business days, notify
                        the Customer/Patient of such circumstances and their
                        causes.
                    </Text>
                    <Text style={styles.tab}>
                        6.5 If no other written instructions are received from
                        the Customer/Patient, the Center shall continue to
                        fulfill its obligations hereunder, to the extent
                        appropriate, and shall search for alternative ways of
                        fulfilling the Contract that do not depend on force
                        majeure circumstances.
                    </Text>
                    <Text style={styles.tab}>
                        7. Amendment and termination of the Contract
                    </Text>
                    <Text style={styles.tab}>
                        7.1. The terms hereof may be amended and supplemented by
                        written agreement of the parties.
                    </Text>
                    <Text style={styles.tab}>
                        7.2. The parties are obliged to notify each other of the
                        intention to terminate the Contract early within three
                        or more working days.
                    </Text>
                    <Text style={styles.tab}>
                        7.3. Termination of this Contract is allowed by
                        agreement of the Parties or by a court decision on the
                        grounds provided for by the civil legislation of the
                        Republic of Kazakhstan.
                    </Text>
                    <Text style={styles.tab}>8. Final provisions</Text>
                    <Text style={styles.tab}>
                        8.1. Neither party has the right to transfer its
                        obligations hereunder to a third party without the
                        written consent of the parties.
                    </Text>
                    <Text style={styles.tab}>
                        8.2. This Contract comes into force from the date of its
                        signing by the parties and is valid until the
                        fulfillment of all obligations of the parties hereunder,
                        with the exception of early termination hereof.
                    </Text>
                    <Text style={styles.tab}>
                        8.3. This Conract is drawn up in two copies having the
                        same legal force, one copy is with the Customer, the
                        other is with the Contractor.
                    </Text>
                    <Text style={styles.tab}>
                        The Contract may be concluded in paper and electronic
                        form in accordance with the civil legislation of the
                        Republic of Kazakhstan.
                    </Text>
                    <Text style={styles.tab}>
                        8.4. All disputes between the Customer and the
                        Contractor related to the fulfillment of the terms
                        hereof are resolved in accordance with the civil
                        legislation of the Republic of Kazakhstan.
                    </Text>
                    <Text style={styles.tab}>
                        8.5. In everything that is not provided for herein, the
                        Parties are guided by the civil legislation of the
                        Republic of Kazakhstan.
                    </Text>
                    <Text style={styles.tab2}>
                        9. Addresses and details of the Parties:
                    </Text>
                    <View style={styles.flexeble}>
                        <View style={styles.blocks}>
                            <Text>CONTRACTOR:</Text>
                            <Text>
                                UMIT International Oncological Center of
                                Tomotherapy LLP
                            </Text>
                            <Text>Address: 42/1 Abylai Khan Ave., Astana,</Text>
                            <Text>010000, Republic of Kazakhstan</Text>
                            <Text>BIN: 160440010230 </Text>
                            <Text>IIC: KZ896017111000008471</Text>
                            <Text>Bank: Halyk Bank of Kazakhstan JSC</Text>
                            <Text>BIC: HSBKKZKX</Text>
                            <Text>e-mail: too.umit@tomo.kz</Text>
                            <Text>
                                tel.: +7 7172 95 44 84, +7 (702) 201 94 44,
                            </Text>
                            <Text>+7 (777) 201 44 44</Text>
                            <Text>Director:</Text>
                            <Text>___________________ Ye. M. Shayakhmetov</Text>
                        </View>

                        <View style={styles.blocks}>
                            <Text>CUSTOMER:</Text>
                            <Text>{UserDataStore.user.fio}</Text>
                            <Text>Address:{UserDataStore.user.adress}</Text>
                            <Text>IIN:{UserDataStore.user.iin}</Text>
                            <Text>e-mail: {UserDataStore.user.Email}</Text>
                            <Text>tel.: {UserDataStore.user.phone}</Text>

                            <Text>
                                Date {date.getDate()}.{date.getMonth() + 1}.
                                {date.getFullYear()}
                            </Text>
                            <Text>{UserDataStore.user.fio}</Text>

                            <View>
                                {signature && (
                                    <Image
                                        style={styles.image}
                                        src={signature}
                                    />
                                )}
                            </View>
                        </View>
                    </View>
                </View>
            </Page>
        </>
    );
}

let date = new Date();
const PDFDocument = ({ signature }) => (
    <Document>
        {UserDataStore.langs == "ru" ? rusDoc(signature) : ""}
        {UserDataStore.langs == "kz" ? kzDoc(signature) : ""}
        {UserDataStore.langs == "en" ? enDoc(signature) : ""}
    </Document>
);

export default PDFDocument;
